Tekla Open API Reference for Tekla Structures 2025
NoAttributes Methods
The DrawingObject.NoAttributes type exposes the following members.
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 It is not possible to load attributes for objects of this type because the objects have no attributes.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
DrawingObject.NoAttributes Class
Tekla.Structures.Drawing Namespace